import random

NEIGHBORINGLETTERS = {
       'ေ': ['ဆ', 'တ', 'ျ', 'ဖ',  'ဈ', 'ဝ', 'ှ', 'ဇ', 'ဗ'],
       'ဗ': ['ဆ', 'တ', 'ျ', 'ဖ', 'ဈ', 'ဝ', 'ှ', 'ဇ', 'ေ'],
       'ဘ': ['လ', 'ါ', '့', 'ည', 'ဠ', 'ွ', 'ံ','ဉ','ယ'],
       'ယ': ['လ', 'ါ', '့', 'ည', 'ဠ', 'ွ', 'ံ','ဉ','ဘ'],    
       'ခ': ['ထ', 'ိ', '်', 'လ', 'ဃ', 'ဌ','ီ','္','ဠ'],
       'ဃ': ['ထ', 'ိ', '်', 'လ', 'ခ', 'ဌ','ီ','္','ဠ'], 
       'ိ': ['ျ', 'န', 'မ', '်', 'ခ', 'ထ', 'ှ', 'ဣ', '၎', '္', 'ဃ', 'ဌ', 'ီ'],
       'ီ': ['ျ', 'န', 'မ', '်', 'ခ', 'ထ', 'ှ', 'ဣ', '၎', '္', 'ဃ', 'ဌ', 'ိ'],
       'န': ['မ', 'ိ', 'ျ', 'တ', '၎', 'ီ', 'ှ', 'ဝ', 'ဣ'],
       'ဣ': ['မ', 'ိ', 'ျ', 'တ', '၎', 'ီ', 'ှ', 'ဝ', 'န'],
       '်': ['ိ', 'မ', 'အ', 'ါ', 'လ', 'ခ', 'ီ', '၎', 'ဤ', 'ွ', 'ဠ', 'ဃ', '္'],
       '္': ['ိ', 'မ', 'အ', 'ါ', 'လ', 'ခ', 'ီ', '၎', 'ဤ', 'ွ', 'ဠ', 'ဃ', '်'],
       'ါ': ['်', 'အ', 'ပ', '့', 'ဘ', 'လ', '္', 'ဤ', '၌', 'ံ', 'ယ', 'ဠ', 'ွ'],
       'ွ': ['ိ', 'မ', 'အ', 'ါ', 'လ', 'ခ', 'ီ', '၎', 'ဤ', 'ွ', 'ဠ', 'ဃ', 'ါ'], 
       '့': ['ည', 'ဘ', 'ါ', 'ပ', 'က', 'ြ', 'ဉ', 'ယ', 'ွ', '၌', 'ဥ', 'ဲ', 'ံ'],
       'ံ': ['ည', 'ဘ', 'ါ', 'ပ', 'က', 'ြ', 'ဉ', 'ယ', 'ွ', '၌', 'ဥ', 'ဲ', '့'],
       'င': ['သ', 'ု', 'ြ', 'က', 'ဿ', 'ဒ' 'ဲ', 'ဥ', '၍'],
       '၍': ['သ', 'ု', 'ြ', 'က', 'ဿ', 'ဒ' 'ဲ', 'ဥ', 'င'],
       'ြ': ['့', 'က', 'င', 'ု', 'ာ', 'ည', 'ံ', 'ဥ', '၍', 'ဒ', 'ဦ', 'ဉ', 'ဲ'],
       'ဲ': ['့', 'က', 'င', 'ု', 'ာ', 'ည', 'ံ', 'ဥ', '၍', 'ဒ', 'ဦ', 'ဉ', 'ြ'],
       'ု': ['ြ', 'င', 'သ', 'ူ', 'ာ', 'ဲ', '၍', 'ဿ', 'ဓ', 'ဦ', 'ဒ'],
       'ဒ': ['ြ', 'င', 'သ', 'ူ', 'ာ', 'ဲ', '၍', 'ဿ', 'ဓ', 'ဦ', 'ု'], 
       'ူ': ['ု', 'သ', 'စ', 'ဒ', 'ဿ', 'ဏ', 'ဓ'],
       'ဓ': ['ု', 'သ', 'စ', 'ဒ', 'ဿ', 'ဏ', 'ူ'],
       'ာ': ['ည', 'ြ', 'ု', 'ဉ', 'ဲ', 'ဒ', 'ဦ'],
       'ဦ': ['ည', 'ြ', 'ု', 'ဉ', 'ဲ', 'ဒ', 'ာ'],
       'ည': ['ဘ', '့', 'ြ', 'ာ', 'ယ', 'ံ', 'ဲ', 'ဦ', 'ဉ'],
       'ဉ': ['ဘ', '့', 'ြ', 'ာ', 'ယ', 'ံ', 'ဲ', 'ဦ', 'ည', 'ဥ'],
       'သ': ['င', 'ု', 'ူ', 'စ', '၍', 'ဒ', 'ဓ', 'ဏ', 'ဿ' ],
       'ဿ': ['င', 'ု', 'ူ', 'စ', '၍', 'ဒ', 'ဓ', 'ဏ', 'သ' ],  
       'စ': ['သ', 'ူ', 'ဿ', 'ဓ', 'ဏ'],
       'ဏ': ['သ', 'ူ', 'ဿ', 'ဓ', 'စ'],   
       'ဆ': ['ေ', 'တ', 'ဗ', 'ဝ', 'ဈ'],
       'ဈ': ['ေ', 'တ', 'ဗ', 'ဝ', 'ဆ'],
       'မ': ['န', 'ိ', '်', 'အ', 'ဣ', 'ီ', '္', 'ဤ', '၎'],
       '၎': ['န', 'ိ', '်', 'အ', 'ဣ', 'ီ', '္', 'ဤ', 'မ'],
       'ျ': ['ေ', 'ဖ', 'ထ', 'ိ', 'န', 'တ', 'ဗ', 'ဇ', 'ဌ', 'ီ', 'ဣ', 'ှ'],
       'ှ': ['ေ', 'ဖ', 'ထ', 'ိ', 'န', 'တ', 'ဗ', 'ဇ', 'ဌ', 'ီ', 'ဣ', 'ျ'],
       'အ': ['မ', '်', 'ါ', 'ပ', '၎', '္', 'ွ', '၌', 'ဤ'],
       'ဤ': ['မ', '်', 'ါ', 'ပ', '၎', '္', 'ွ', '၌', 'အ'],
       'က': ['ပ', '့', 'ြ', 'င', '၌', 'ံ', 'ဲ', '၍', 'ဥ'],
       'ဥ': ['ပ', '့', 'ြ', 'င', '၌', 'ံ', 'ဲ', '၍', 'က'],  
       'လ': ['ခ', '်', 'ါ', 'ဘ', 'ဃ', '္', 'ွ', 'ယ', 'ဠ'],
       'ဠ': ['ခ', '်', 'ါ', 'ဘ', 'ဃ', '္', 'ွ', 'ယ', 'လ'],
       'တ': ['ဆ', 'ေ', 'ျ', 'ိ', 'န', 'ဈ', 'ဗ', 'ှ', 'ီ', 'ဣ', 'ဝ'],
       'ဝ': ['ဆ', 'ေ', 'ျ', 'ိ', 'န', 'ဈ', 'ဗ', 'ှ', 'ီ', 'ဣ', 'တ'],
       'ထ': ['ဇ', 'ျ', 'ိ', 'ခ', 'ဇ', 'ှ', 'ီ', 'ဃ', 'ဌ'],
       'ဌ': ['ဇ', 'ျ', 'ိ', 'ခ', 'ဇ', 'ှ', 'ီ', 'ဃ', 'ထ'],
       'ပ': ['အ', 'ါ', '့', 'က', 'ဤ', 'ွ', 'ံ', 'ဥ', '၌'],
       '၌': ['အ', 'ါ', '့', 'က', 'ဤ', 'ွ', 'ံ', 'ဥ', 'ပ'],
      'ဖ': ['ေ', 'ျ', 'ထ', 'ဗ', 'ှ', 'ဌ', 'ဇ'],
      'ဇ': ['ေ', 'ျ', 'ထ', 'ဗ', 'ှ', 'ဌ', 'ဖ'],
      'ရ': ['၇', 'စ', 'ယ', 'ဏ', 'ဪ', 'ဩ', 'ဖ'],  
      'ဎ': ['ဍ', 'ဋ', 'ဠ', 'ဃ'],
      'ဍ': ['ဎ', 'ဋ', 'ဠ', 'ဃ'],
      'ဋ': ['ဍ', 'ဎ', 'ဠ', 'ဃ']
}

NEIGHBORINGNUMPADDIGITS = {
    '၀': ['၁', '၂'],
    '၁': ['၄', '၅', '၂', '၀'],
    '၂': ['၀', '၁', '၄', '၅', '၆', '၃'],
    '၃': ['၂', '၅', '၆'],
    '၄': ['၇', '၈', '၅', '၂', '၁'],
    '၅': ['၇', '၈', '၉', '၄', '၆', '၁', '၂', '၃'],
    '၆': ['၉', '၈', '၅', '၂', '၃'],
    '၇': ['၈', '၅', '၄'],
    '၈': ['၇', '၄', '၅', '၆', '၉'],
    '၉': ['၈', '၅', '၆']
}

VISUALLYSIMILARDIGITS = {
    '၀': ['ဝ', '၁', 'င', 'ခ', 'ပ', 'ဂ', 'စ'],
    '၁': ['၀', 'ဝ', 'ခ', 'ပ', 'ဂ'],
    '၂': ['ျ', 'ှ'],
    '၃': ['ဥ', 'ဍ', 'ဉ'],
    '၄': ['ဌ', 'ဠ', '၎'],
    '၅': ['ရ'],
    '၇': ['ရ', '၅'],
    '၈': ['ဂ', 'ပ', '၀']
}

VISUALLYSIMILARCHARS = {
    'ဝ': ['၀', '၁', 'င', 'ခ', 'ပ', 'ဂ', 'စ'],
    'ခ': ['၀', 'ဝ', 'ခ', 'ပ', 'ဂ', 'စ'],
    'ဂ': ['၈', 'ပ', '၀'],
    'ရ': ['၇'],
    'ဉ': ['၃', 'ဥ'],
    '၎': ['ဌ', 'ဠ', '၄']
}

#COMMON_Syl_ERRORS = {
#    'ရ': ['၇'],
#    'ဉာဏ်': ['ဥာဏ်'],
#    '၎င်း': ['၄င်း'],
#    'တွေ': ['တေ'],
#    'နဲ့': ['နက်'],
#    'အေး': ['အေ့'],
#    'ချင်း': ['ဂျင်း'],
#    'ဈေး': ['စျေး'],
#    'ဖြစ်': ['ဖစ်'],
#    'ပြီ': ['ပီ', 'ပြိ'],
#    'ပြီး': ['ပီး', 'ပိ'],
#    'တယ်': ['တေ'],
#    'ရယ်': ['ရီ'],  
#   'နင်': ['နိ'],
#    'တို့': ['ဒို့'],
#    'လား': ['လာ့']
#}

# Data type classes, and capitalization are preserved.
def get_random_neighbor(char, seed=None):
    if seed is not None:
        random.seed(seed)

    if len(char) != 1:
        raise Exception("Need exactly one character to find a neighbor")

    if char.isdecimal():
        numpad = random.choice([True, False])
        if numpad:
            return random.choice(NEIGHBORINGNUMPADDIGITS[char])
        else:
            if char == '0':
                return '9'
            elif char == '1':
                return '2'
            else:
                return str(int(char) + (-1) ** random.randint(0, 1))
    elif char.lower() in NEIGHBORINGLETTERS:
        neighbor = random.choice(NEIGHBORINGLETTERS[char.lower()])
        return neighbor.upper() if char.isupper() else neighbor
    else:
        return char


def get_random_visually_similar_char(char, seed=None):
    if seed is not None:
        random.seed(seed)

    if len(char) != 1:
        raise Exception("Need exactly one character to find a visually similar character")

    if char in VISUALLYSIMILARCHARS:
        return random.choice((VISUALLYSIMILARCHARS[char]))
    else:
        return char


def get_random_visually_similar_digit(char, seed=None):
    if seed is not None:
        random.seed(seed)

    if len(char) != 1:
        raise Exception("Need exactly one character to find a visually similar digit")

    if char.isdigit():
        if char in VISUALLYSIMILARDIGITS:
            return random.choice((VISUALLYSIMILARDIGITS[char]))
        else:
            return char
    else:
        raise Exception("'" + char + "' is not a digit.")
